# ~/.Brewfile

# Taps
tap "anomalyco/tap"
tap "nikitabobko/tap"

# CLI
brew "anomalyco/tap/opencode"

brew "neovim"
brew "starship"
brew "ripgrep"
brew "eza"        # Modern ls replacement
brew "fzf"        # Fuzzy finder
brew "zoxide"     # Smarter cd
brew "lazygit"    # Git TUI
brew "node"
brew "python"
brew "rustup"
brew "tree-sitter-cli"

# Casks
cask "arduino-ide"
cask "ghostty"
cask "betterdisplay"
cask "google-chrome"
cask "microsoft-teams"
cask "microsoft-outlook"
cask "font-sf-pro"
cask "discord"
cask "steam"
cask "vlc"
