# ~/.Brewfile

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "anomalyco/tap" 
tap "nikitabobko/tap"
tap "FelixKratz/formulae"
tap "Jean-Tinland/a-bar"

# ── Terminal & Shell ──────────────────────────────────────────────────────────
cask "ghostty"                 # Terminal emulator
brew "starship"                # Shell prompt
brew "zoxide"                  # Smarter cd
brew "fzf"                     # Fuzzy finder
brew "atuin"                   # Shell history search (SQLite, syncable)
brew "bat"                     # cat with syntax highlighting
brew "zellij"                  # Modern tmux alternative
brew "poppler"
brew "stow"

# ── Neovim ────────────────────────────────────────────────────────────────────
brew "neovim"
brew "tree-sitter-cli"         # Parser generator (Treesitter)
brew "ripgrep"                 # grep backend for Telescope
brew "fd"                      # fast find, required by Telescope file finder
brew "lua-language-server"     # LSP for Lua/Neovim config
brew "stylua"                  # Lua formatter

# ── CLI Utilities ─────────────────────────────────────────────────────────────
brew "eza"                     # Modern ls replacement
brew "lazygit"                 # Git TUI
brew "lazydocker"              # Docker TUI
brew "delta"                   # Better git diffs (integrates with lazygit)
brew "btop"                    # System monitor
brew "jq"                      # JSON processor
brew "tldr"                    # Practical man page summaries
brew "dust"                    # Intuitive du replacement
brew "yazi"                    # Terminal file manager (image previews in Ghostty)
brew "neofetch"

# ── Languages & Runtimes ──────────────────────────────────────────────────────
brew "node"
brew "python"
brew "rustup"
brew "go"
brew "uv"                      # Fast Python package/project manager
brew "deno"                    # JS/TS scripting outside Node
brew "typst"

# ── AI ────────────────────────────────────────────────────────────────────────
brew "anomalyco/tap/opencode"
brew "ollama"                  # Run local LLMs (Llama, Gemma, Mistral etc.)

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-sf-pro"
cask "font-jetbrains-mono-nerd-font"  # Popular Neovim pairing
cask "font-fira-code-nerd-font"       # Already using in Ghostty

# ── Creative & Hardware ───────────────────────────────────────────────────────
cask "arduino-ide"
cask "vlc"
brew "ffmpeg"                  # Video/audio processing

# ── Display & WM ──────────────────────────────────────────────────────────────
cask "betterdisplay"
cask "nikitabobko/tap/aerospace"  # i3-style tiling window manager for macOS
cask "jean-tinland/a-bar/a-bar"
brew "FelixKratz/formulae/borders"


# ── Communication ─────────────────────────────────────────────────────────────
cask "discord"
cask "microsoft-teams"
cask "microsoft-outlook"

# ── Browsers ──────────────────────────────────────────────────────────────────
cask "google-chrome"

# ── Gaming ────────────────────────────────────────────────────────────────────
cask "steam"

